1.1程序设计的基本元素
	(define ( <name> <formal oarameters>) <body> )
	 	    （名字	形式参数）		表达式
---------------------------------------------------------------------

	(cond ( <p1> <e1> )
		( <p2> <e2> )
		:

		( <pn> <en> )
		( else <e> )
谓词真假 真的求值 假的计算下一个谓词真假 直到出现#t  如果所有的都为假 计算else的值
---------------------------------------------------------------------

(if <predicate> <consequent> <alternative>)
	条件		真		假



-------------------------------------------------------------------------
(and <e1>...<en>)

从左到右；其中有一个<e>为假就是假；<e>都是真的值为最后一个<e>的值为表达式的值
-------------------------------------------------------------------------
(or <e1>...<en>)
从左到右；有一个为<e>为真后面就不再求值， 表达式为真 值为<e>；都是假的表达式为假 
-------------------------------------------------------------------------
(not <e>)
-------------------------------------------------------------------------
